In [ ]:
# Data Loading
# Selecting row and Columns
# Indexes
# Filtering
# Update Rows and columns
# Add / Remove 
# Sorting
# Grouping and Aggregrate
# Cleaning, Casting and Handling NA
# Date and Time Series
# Reading with differenct sources

In [2]:
import pandas as pd

In [44]:
dict = {
    'First':['Shahzad','Muhammad','Iqbal'],
    'Last' :['Ahmed','Saad','Ahmed'],
    'email':['Shaze.ahmed@gmail.com','Msaad@gmail.com','Iqo@GmaiL.com']}
df = pd.DataFrame(dict)

In [45]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [63]:
df.columns = ['first name','last name','email']
# df.columns = [x.upper() for x in df.columns]
# df.columns = df.columns.str.lower()
df

  first name last name                  email
0    Shahzad     Ahmed  Shaze.ahmed@gmail.com
1   Muhammad      Saad        Msaad@gmail.com
2      Iqbal     Ahmed          Iqo@GmaiL.com

In [64]:
df.columns = df.columns.str.replace(' ','_')
df

  first_name last_name                  email
0    Shahzad     Ahmed  Shaze.ahmed@gmail.com
1   Muhammad      Saad        Msaad@gmail.com
2      Iqbal     Ahmed          Iqo@GmaiL.com

In [65]:
df.rename(columns={'first_name':'first','last_name':'last'})
df

  first_name last_name                  email
0    Shahzad     Ahmed  Shaze.ahmed@gmail.com
1   Muhammad      Saad        Msaad@gmail.com
2      Iqbal     Ahmed          Iqo@GmaiL.com

In [67]:
df.loc[2] = ['Iqbal','Ahmeed','test@gmail.com']
df

  first_name last_name                  email
0    Shahzad     Ahmed  Shaze.ahmed@gmail.com
1   Muhammad      Saad        Msaad@gmail.com
2      Iqbal    Ahmeed         test@gmail.com

In [70]:
df.loc[2, ['last_name','email']] = ['Ahmed','iqo@gmail.com']
df

  first_name last_name                  email
0    Shahzad     Ahmed  Shaze.ahmed@gmail.com
1   Muhammad      Saad        Msaad@gmail.com
2      Iqbal     Ahmed          iqo@gmail.com

In [34]:
filt = df['last'].str.casefold()  =='ahmed'

In [49]:
df.loc[-filt, 'email']

1    Msaad@gmail.com
Name: email, dtype: object

In [53]:
df[df['last'].str.contains('Ahmed')]

     first   last                  email
0  Shahzad  Ahmed  Shaze.ahmed@gmail.com
2    Iqbal  Ahmed          Iqo@GmaiL.com

In [72]:
df['email'].apply(len)

0    21
1    15
2    13
Name: email, dtype: int64

In [73]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

  first_name last_name                  email
0    Shahzad     Ahmed  shaze.ahmed@gmail.com
1   Muhammad      Saad        msaad@gmail.com
2      Iqbal     Ahmed          iqo@gmail.com

In [77]:
df.apply(len, axis='columns')
df.apply(len, axis=1)

0    3
1    3
2    3
dtype: int64

In [79]:
df.apply(lambda x: x.min())

first_name            Iqbal
last_name             Ahmed
email         iqo@gmail.com
dtype: object

In [80]:
df.applymap(len)

   first_name  last_name  email
0           7          5     21
1           8          4     15
2           5          5     13

In [83]:
df['first_name'].map({'Shahzad':'Zubair'})

0    Zubair
1       NaN
2       NaN
Name: first_name, dtype: object

In [87]:
df['first_name'].replace({'Shahzad':'Zubair'})

0      Zubair
1    Muhammad
2       Iqbal
Name: first_name, dtype: object

In [88]:
df

  first_name last_name                  email
0    Shahzad     Ahmed  shaze.ahmed@gmail.com
1   Muhammad      Saad        msaad@gmail.com
2      Iqbal     Ahmed          iqo@gmail.com

In [91]:
df['full_name'] = df['first_name'] + ' ' + df['last_name']
df

  first_name last_name                  email      full_name
0    Shahzad     Ahmed  shaze.ahmed@gmail.com  Shahzad Ahmed
1   Muhammad      Saad        msaad@gmail.com  Muhammad Saad
2      Iqbal     Ahmed          iqo@gmail.com    Iqbal Ahmed

In [95]:
df.drop(columns=['first_name','last_name'], inplace=True)
df

                   email      full_name
0  shaze.ahmed@gmail.com  Shahzad Ahmed
1        msaad@gmail.com  Muhammad Saad
2          iqo@gmail.com    Iqbal Ahmed

In [99]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)
df

                   email      full_name     first   last
0  shaze.ahmed@gmail.com  Shahzad Ahmed   Shahzad  Ahmed
1        msaad@gmail.com  Muhammad Saad  Muhammad   Saad
2          iqo@gmail.com    Iqbal Ahmed     Iqbal  Ahmed

In [102]:
df.append({'first':'zubair'} ,ignore_index=True)

C:\Users\shahzad.ahmed1\AppData\Local\Temp\ipykernel_16880\1036720932.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'zubair'} ,ignore_index=True)

                   email      full_name     first   last
0  shaze.ahmed@gmail.com  Shahzad Ahmed   Shahzad  Ahmed
1        msaad@gmail.com  Muhammad Saad  Muhammad   Saad
2          iqo@gmail.com    Iqbal Ahmed     Iqbal  Ahmed
3                    NaN            NaN    zubair    NaN

In [137]:
dict = {
    'first':['Muhammad','Khurram'],
    'last' :['Zubair','Kamal'],
    'email':['zubair@gmail.com','KK@gmail.com']}

In [138]:
df2 = pd.DataFrame(dict)
df2

      first    last             email
0  Muhammad  Zubair  zubair@gmail.com
1   Khurram   Kamal      KK@gmail.com

In [139]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\shahzad.ahmed1\AppData\Local\Temp\ipykernel_16880\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [135]:
df.drop(['First','Last'], axis='columns', inplace=True)

In [140]:
df

                   email      full_name     first    last
0  shaze.ahmed@gmail.com  Shahzad Ahmed   Shahzad   Ahmed
1        msaad@gmail.com  Muhammad Saad  Muhammad    Saad
2          iqo@gmail.com    Iqbal Ahmed     Iqbal   Ahmed
3       zubair@gmail.com            NaN       NaN     NaN
4           KK@gmail.com            NaN       NaN     NaN
5       zubair@gmail.com            NaN  Muhammad  Zubair
6           KK@gmail.com            NaN   Khurram   Kamal

In [120]:
df.drop(index=4)

                   email      full_name     first   last     First    Last
0  shaze.ahmed@gmail.com  Shahzad Ahmed   Shahzad  Ahmed       NaN     NaN
1        msaad@gmail.com  Muhammad Saad  Muhammad   Saad       NaN     NaN
2          iqo@gmail.com    Iqbal Ahmed     Iqbal  Ahmed       NaN     NaN
3       zubair@gmail.com            NaN       NaN    NaN  Muhammad  Zubair

In [125]:
df.drop(index=df[df['last'] == 'Ahmed'].index)

              email      full_name     first  last     First    Last
1   msaad@gmail.com  Muhammad Saad  Muhammad  Saad       NaN     NaN
3  zubair@gmail.com            NaN       NaN   NaN  Muhammad  Zubair
4      KK@gmail.com            NaN       NaN   NaN   Khurram   Kamal

In [149]:
# df.sort_values(by=['email','last'], ascending=False)
df.sort_values(by=['email','last'], ascending=[False,True])

                   email      full_name     first    last
5       zubair@gmail.com            NaN  Muhammad  Zubair
3       zubair@gmail.com            NaN       NaN     NaN
0  shaze.ahmed@gmail.com  Shahzad Ahmed   Shahzad   Ahmed
1        msaad@gmail.com  Muhammad Saad  Muhammad    Saad
2          iqo@gmail.com    Iqbal Ahmed     Iqbal   Ahmed
6           KK@gmail.com            NaN   Khurram   Kamal
4           KK@gmail.com            NaN       NaN     NaN

In [144]:
df.sort_index()

                   email      full_name     first    last
0  shaze.ahmed@gmail.com  Shahzad Ahmed   Shahzad   Ahmed
1        msaad@gmail.com  Muhammad Saad  Muhammad    Saad
2          iqo@gmail.com    Iqbal Ahmed     Iqbal   Ahmed
3       zubair@gmail.com            NaN       NaN     NaN
4           KK@gmail.com            NaN       NaN     NaN
5       zubair@gmail.com            NaN  Muhammad  Zubair
6           KK@gmail.com            NaN   Khurram   Kamal

In [148]:
df['email'].sort_values(ascending=False)

3         zubair@gmail.com
5         zubair@gmail.com
0    shaze.ahmed@gmail.com
1          msaad@gmail.com
2            iqo@gmail.com
4             KK@gmail.com
6             KK@gmail.com
Name: email, dtype: object

In [151]:
df['first'].nlargest(10) # working on numbers columns
df.nlargest(10, 'first')
df.nsmallest(10, 'fist')

TypeError: Cannot use method 'nlargest' with dtype object